# Sublime Text 3 Mac 指南
# 本篇是根据kpman|Code 博客所写的，主要为方便自己忘记快捷键时可以快速查看，也希望对各位有一些些帮助。
# 
# 快捷键
# 左边为文章中对快捷键缩写，右边为对应完成对键名。
# cmd=command
# shift=shift
# option=optino（alt）
# control=control
# pkg-ctrl=package control（command+shift+p）
# 
# 基础模式
# 此部分为初学使用sublime常使用的快捷键，为比较常用的部分。
# 1. cmd + o (open)
# 快速打开一个文件夹
# 2. cmd + w
# 关闭一个标签页
# 3. cmd + n
# 新建一个untitled标签页
# 4. cmd + shift + t
# 重新打开，上一次关闭的标签页
# 5. cmd + shift + v
# 可以打开黏贴板，相当于是打开了复制记录，然后可以选择内容黏贴。
# 
# 编辑快捷键
# 一下快捷键为编辑时，常使用的快捷键
# 1. cmd + option + 數字
# 分割窗口，让你在同一个窗口上可以同时编辑两个标签页。
# 切换左边窗口为cmd + option + 1 和切换右边窗口为cmd + option + 2 之间进行切换。
# 使用情景：左边.html右边.css，编辑起来快速方便。
# 
# 2. cmd + k 再 cmd + b
# 使得编辑器可以在全屏和文件夹导航之间进行切换。
# 
# 选取
# 以下部分为sublime text编辑器的选取功能，使用频率比较高。
# 1. cmd + d (可连续按)
# 快速选取一个词汇或者是光标附近的一个字符串，连按d的话会选取距离当前光标最近的一个相同的选中字符串，选中后可以对相应的字符串进行编辑。
# 
# 2. cmd + l (可连按)
# 选取光标所在的一整行内容，連按l的可以依次选中光标之下的整行内容。
# 
# 3. cmd + shift + l
# 此功能常于上述cmd + l配合，每当选中多行后，按下cmd + shift + l，则会在选中的每一行最末端出现一个光标，之后可以对相应对内容进行编辑。
# 
# 4. option + 滑鼠拖拉
# 当按住option后，搭配鼠标拖拉便可以一次选取多行，并且产生光标。
# 注意：拖曳的时候，鼠标是由上到下垂直的选取。
# 
# 5. cmd + 鼠标点击
# 按住cmd后，利用鼠标在相应的位置上进行点击，便可以在对应点击的位置新增一个光标。
# 
# 寻找
# 在sublime裡面寻找的功能做的非常強大，不论是文件內、或是文件名称都可以快速找到。
# 以下部分将会利用GoTo Anything这个强大的功能来做例子。
# 1. cmd + p + 文件名
# 利用cmd + p，在命令输入框出现之后，即可输入你需要寻找的文件名，按下enter即可打开对应的文件。
# 
# 2. cmd + p + “:” + 行数
# 此功能相相同于control + g，可以快速转跳到你指定的行數。